[
  {
    "company": "Skinstric",
    "role": "Software Developer (Frontend)",
    "resps": [
      "Architected a real-time skin analysis platform using OpenAI Vision API and Next.js, achieving 98% detection accuracy across various skin conditions.",
      "Developed a responsive UI with TailwindCSS and GSAP animations, including dynamic skincare recommendation cards that boosted user engagement by 60%.",
      "Built a custom animation system using GSAP timelines for smooth user experience during skin analysis, increasing user retention by 40%.",
      "Optimized performance using Next.js Server Components and Lottie animations, achieving sub-2-second load and analysis times.",
      "Designed a modular, reusable component library in TailwindCSS for skincare product displays, enabling rapid A/B testing of layouts and improving iteration speed.",
      "Implemented an efficient image processing pipeline integrating the OpenAI Vision API with a 4D Mini model, improving skin tone and texture detection accuracy."
    ],
    "date": "Sept 2024 – Apr 2025"
  },
  {
    "company": "Frontend Simplified",
    "role": "Frontend Developer & Support Staff",
    "resps": [
      "Mentored 20+ students after placing in the top 5% of the cohort, providing debugging support and code reviews for React and Next.js projects.",
      "Created and led workshops on frontend optimization, helping students reduce portfolio project load times by an average of 50%.",
      "Developed learning resources on React component architecture and TypeScript, enabling 70% of mentored students to build type-safe applications.",
      "Hosted weekly pair programming sessions focused on accessibility and SEO best practices, resulting in 90% of students reaching WCAG compliance.",
      "Built and distributed a reusable component library using ShadCN/UI, cutting student project development time by 40% and improving code consistency.",
      "Led study groups on deployment strategies and CI/CD, resulting in 85% of students successfully launching automated deployment pipelines."
    ],
    "date": "Jan 2024 – Aug 2024"
  }
]
